"DOWNGRADE_TITLE" = "A newer version of Java is already installed.";

"DOWNGRADE_MESSAGE" = "You are trying to install %1$@, however %2$@ is already installed.\nVisit java.com/newerversionexists for more information.";

"Restore Security Prompts" = "Restore Security Prompts";

"Browser Plug-in Disabled" = "Browser Plug-in Disabled";

"Continue" = "Continue";

"Close" = "Close";

"Install" = "Install";

"Finish" = "Finish";

"You have Successfully Installed %@ \nand the Ask extension(s)." = "You have Successfully Installed %1$@ \nand the Ask extension(s).";

"The security level has been set to a minimum value of High." = "The security level has been set to a minimum value of High.";

/* Dynamic welcome string */
"Welcome to the %@ Installer" = "Welcome to the %1$@ Installer";

/* Dynamic complete string */
"You have successfully installed %@." = "You have successfully installed %1$@.";

"Information about" = "Important Information about Oracle Java SE Roadmap:";

"Oracle has announced" = "Changes are coming which will impact your access to future releases of Java SE from Oracle. ";

"Corporate users may" = "Corporate users will be impacted as soon as January 2019. ";

"and others" = "For additional guidance please follow the link below.\n";

"More Information on roadmap" = "More Information on roadmap";

"Changes are" = "Changes are coming which will impact your access to future releases of Java SE from Oracle.\n\n";

"Corporate users" = "Corporate users will be impacted with the April 2019 update.\n\n";

"These changes" = "These changes do not affect the version you are about to install.";

"For additional" = "For additional guidance please follow the link below.\n\n";

"More Information..." = "More Information...";

"Important Info" = "Important Information about Oracle Java SE Roadmap";

"OK" = "OK";

"Java provides" = "Java provides access to a world of amazing content. From business solutions to helpful utilities and entertainment, Java makes your Internet experience come to life.\n\n";

"Note: No" = "Note: No personal information is gathered as part of our install process.\n";

/* hyperlink - do not use punctuation */
"Click here" = "Click here";

/* Click here for more information on what we do collect. is the full sentence */
" for more" = " for more information on what we do collect.";

"Click Install" = "Click Install to accept the ";

"license agreement" = "license agreement";

" and install" = " and install Java now.";

"Install >" = "Install >";

"Please remove" = "Please remove outdated versions of Java";

"The Java software" = "The Java software version on this computer is not current and there are no further updates to it.\n\n";

"Keeping out-of-date" = "Keeping out-of-date versions of Java on your system may present a security risk.\n\n";

"If you still" = "If you still require Java to run desktop applications after removal, please visit ";

" for a recommended" = " for a recommended version.";

"Remove" = "Remove >";

"Java Deployment" = "Java Deployment Cache";

"Java maintains" = "Java maintains a cache to speed the reloading of commonly used Java programs and store trace and log files. As you are removing the Java Runtime, we recommend also removing this cache to free space on your computer.\n\nLearn more about the ";

"Java Deployment Cache" = "Java Deployment Cache";

"Would you like" = "\n\nWould you like to remove the Java Cache (recommended)?";

"Yes" = "Yes";

"No" = "No";

"Uninstalled" = "You have successfully removed Java";

"NoJavaToUninstall" = "No Java installation is detected on the system";

"Complete" = "Complete";

"Later" = "Later";

"Update" = "Update";

"Please remove unused" = "Please remove unused versions of Java";

/* It appears that you have not used Java on your system in over 6 months. We recommend that you uninstall it by clicking the Remove button below. */
"It appears that" = "It appears that you have not used Java on your system in over 6 months. We recommend that you uninstall it by clicking the ";
" Remove" = "Remove";
" button below." = " button below.";

"If you later" = " If you later decide you need Java, you can re-install it from java.com.";

/* If you wish to" = "If you wish to keep Java on your system, please update it by clicking the Update button below. */
"If you wish to" = "If you wish to keep Java on your system, please update it by clicking the ";
" Update" = "Update";

"Fail to install" = "Failed to install Java";

"Uninstalling" = "Uninstalling Java...";

"Fail to uninstall" = "Failed to uninstall Java: %@";

"XPC connection error." = "XPC connection error.";

"Error code" = "OS error code %lld.";

"shell is not available." = "shell is not available.";

"process cannot be created." = "process cannot be created.";

"Commercial License" = "Commercial License Required for this version";

"Use of this" = "Use of this version requires that you have a commercial license acquired either by you or by one of your software providers.";

"You can also" = "You can also use this version for running Licensed Oracle Products that require a Java Runtime.";

"Learn more about this release" = "Learn more about this release";

"Details on the" = "Details on the information we collect";

"cannot delete" = "cannot delete Java Deployment Cache";

"Password prompt" = "%@ requires permission to continue.";

"Java Update" = "Java Update";

"OSCHECK_TITLE" = "Java from Oracle requires %1$@ %2$@ or later.";

"OSCHECK_MESSAGE" = "Your system has %1$@ Version %2$@. This product can be installed on Version %3$@ or later.\nVisit java.com/help for more information.";

"Welcome to Java" = "Welcome to Java";

"This version" = "This version of Java requires that you have a license for Oracle Java SE from Oracle, an authorized Oracle Partner, or authorized third party software provider. It is your responsibility to determine whether you have an appropriate license. If you do, please click Install to continue with the installation process.";

"If you have" = "If you don't have a license, please click Remove to stop the install process and elect whether to remove older Java versions.";

"No personal" = "No personal information is gathered as part of our install process";

"Welcome to Java -" = "Welcome to Java - Updated License Terms";

"The terms" = "The terms under which this version of the software is licensed have changed.";

"Updated License" = "Updated License Agreement";

"This version -" = "This version of the Java Runtime is licensed only for personal (non-commercial) desktop and laptop use.";

"Commercial use" = "Commercial use of this software requires a separate license from Oracle or from your software vendor.";

"Click install or" = "Click install to accept the license agreement and install Java now or click Remove to uninstall it from your system.";

"Remove -" = "Remove";
